app/Controllers/Lista.php

SELECT *
FROM `tarefas`
WHERE `tarefas`.`cod` = '9'
UPDATE `tarefas` SET `titulo` = 'carne1', `status` = '2'
WHERE `tarefas`.`cod` IN ('9')
DELETE FROM `tarefas`
WHERE `cod` IN ('9')
---
    public function board(){

        if($this->request->getMethod() === 'post'){

            $tarefasModel = new TarefasModel();

            switch($this->request->getPost('tipo')){
                case 'cadastrar':
                    $tarefasModel->set('titulo', $this->request->getPost('titulo'));
                    if($tarefasModel->insert()){
                        return view('board');
                    }
                    break;

                case 'status':
                    $tarefa = $tarefasModel->find($this->request->getPost('cod'));
                    $tarefa['status'] = $this->request->getPost('status');
                    if($tarefasModel->update($this->request->getPost('cod'), $tarefa)){
                        return view('board');
                    }
                    break;

                case 'excluir':
                    if($tarefasModel->delete($this->request->getPost('cod'))){

SELECT *
FROM `tarefas`
WHERE `tarefas`.`cod` = '8'
---
    public function editar($cod){

        $tarefasModel = new TarefasModel();
        $tarefa = $tarefasModel->find($cod);