app/Controllers/Tarefas.php

SELECT *
FROM `tarefas`
---
    public function lista()
    {
        $tarefasModel = new TarefasModel();

        $query = $tarefasModel->findAll();